{
  "_name_or_path": "bloom-1b1",
  "apply_residual_connection_post_layernorm": false,
  "architectures": [
    "BloomForCausalLM"
  ],
  "attention_dropout": 0.0,
  "attention_softmax_in_fp32": true,
  "bias_dropout_fusion": true,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_dropout": 0.0,
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "masked_softmax_fusion": true,
  "max_source_length": 1280,
  "instance_prompt_length":100,
  "column_prompt_length":15,
  "general_prompt_length":20,
  "bone_dim":2048,
  "k":6,
  "model_type": "bloom",
  "n_head": 16,
  "n_inner": null,
  "n_layer": 24,
  "n_stx": 35,
  "max_h":15,
  "max_val":20,
  "n_ttx_col": 10,
  "n_ttx_row": 75,
  "num_virtual_tokens": 100,
  "offset_alibi": 100,
  "pad_token_id": 3,
  "pretraining_tp": 1,
  "prompt_tuning_init_text": "bar,scatter,line,pie,histrgram,box,x,y",
  "seq_length": 2048,
  "skip_bias_add": true,
  "skip_bias_add_qkv": false,
  "slow_but_exact": false,
  "torch_dtype": "float32",
  "transformers_version": "4.29.2",
  "unk_token_id": 0,
  "use_cache": true,
  "vocab_size": 250880
}

